hpmicro/rtt-bsp-hpm6750evkmini/rtt_default_project_0/libraries/hpm-sdk/soc/ip/hpm_spi_regs.h
/*
 * Copyright (c) 2021 hpmicro
 *
 * SPDX-License-Identifier: BSD-3-Clause
 *
 */


#ifndef HPM_SPI_H
#define HPM_SPI_H

typedef struct {
    __R  uint8_t  RESERVED0[16];               /* 0x0 - 0xF: Reserved */
    __RW uint32_t TRANSFMT;                    /* 0x10: Transfer Format Register */
    __RW uint32_t DIRECTIO;                    /* 0x14: Direct IO Control Register */
    __R  uint8_t  RESERVED1[8];                /* 0x18 - 0x1F: Reserved */
    __RW uint32_t TRANSCTRL;                   /* 0x20: Transfer Control Register */
    __RW uint32_t CMD;                         /* 0x24: Command Register */
    __RW uint32_t ADDR;                        /* 0x28: Address Register */
    __RW uint32_t DATA;                        /* 0x2C: Data Register */
    __RW uint32_t CTRL;                        /* 0x30: Control Register */
    __R  uint32_t STATUS;                      /* 0x34: Status Register */
    __RW uint32_t INTREN;                      /* 0x38: Interrupt Enable Register */
    __RW uint32_t INTRST;                      /* 0x3C: Interrupt Status Register */
    __RW uint32_t TIMING;                      /* 0x40: Interface Timing Register */
    __R  uint8_t  RESERVED2[12];               /* 0x44 - 0x4F: Reserved */
    __RW uint32_t MEMCTRL;                     /* 0x50: Memory Access Control Register */
    __R  uint8_t  RESERVED3[12];               /* 0x54 - 0x5F: Reserved */
    __RW uint32_t SLVST;                       /* 0x60: Slave Status Register */
    __R  uint32_t SLVDATACNT;                  /* 0x64: Slave Data Count Register */
    __R  uint8_t  RESERVED4[20];               /* 0x68 - 0x7B: Reserved */
    __R  uint32_t CONFIG;                      /* 0x7C: Configuration Register */
} SPI_Type;


/* Bitfield definition for register: TRANSFMT */
/*
 * ADDRLEN (RW)
 *
 * Address length in bytes 
 * 0x0: 1 byte 
 * 0x1: 2 bytes 
 * 0x2: 3 bytes 
 * 0x3: 4 bytes 
 * 
 */
#define SPI_TRANSFMT_ADDRLEN_MASK (0x30000UL)
#define SPI_TRANSFMT_ADDRLEN_SHIFT (16U)
#define SPI_TRANSFMT_ADDRLEN_SET(x) (((uint32_t)(x) << SPI_TRANSFMT_ADDRLEN_SHIFT) & SPI_TRANSFMT_ADDRLEN_MASK)
#define SPI_TRANSFMT_ADDRLEN_GET(x) (((uint32_t)(x) & SPI_TRANSFMT_ADDRLEN_MASK) >> SPI_TRANSFMT_ADDRLEN_SHIFT)

/*
 * DATALEN (RW)
 *
 * The length of each data unit in bits 
 * The actual bit number of a data unit is (DataLen + 1) 
 * 
 */
#define SPI_TRANSFMT_DATALEN_MASK (0x1F00U)
#define SPI_TRANSFMT_DATALEN_SHIFT (8U)
#define SPI_TRANSFMT_DATALEN_SET(x) (((uint32_t)(x) << SPI_TRANSFMT_DATALEN_SHIFT) & SPI_TRANSFMT_DATALEN_MASK)
#define SPI_TRANSFMT_DATALEN_GET(x) (((uint32_t)(x) & SPI_TRANSFMT_DATALEN_MASK) >> SPI_TRANSFMT_DATALEN_SHIFT)

/*
 * DATAMERGE (RW)
 *
 * Enable Data Merge mode, which does automatic data split on write and data coalescing on read. 
 * This bit only takes effect when DataLen = 0x7. Under Data Merge mode, each write to the Data Register will transmit all fourbytes of the write data; each read from the Data Register will retrieve four bytes of received data as a single word data. 
 * When Data Merge mode is disabled, only the least (DataLen+1) significient bits of the Data Register are valid for read/write operations; no automatic data split/coalescing will be performed. 
 * 
 */
#define SPI_TRANSFMT_DATAMERGE_MASK (0x80U)
#define SPI_TRANSFMT_DATAMERGE_SHIFT (7U)
#define SPI_TRANSFMT_DATAMERGE_SET(x) (((uint32_t)(x) << SPI_TRANSFMT_DATAMERGE_SHIFT) & SPI_TRANSFMT_DATAMERGE_MASK)
#define SPI_TRANSFMT_DATAMERGE_GET(x) (((uint32_t)(x) & SPI_TRANSFMT_DATAMERGE_MASK) >> SPI_TRANSFMT_DATAMERGE_SHIFT)

/*
 * MOSIBIDIR (RW)
 *
 * Bi-directional MOSI in regular (single) mode 
 * 0x0: MOSI is uni-directional signal in regular mode. 
 * 0x1: MOSI is bi-directional signal in regular mode. This bi-directional signal replaces the two 
 * 
 */
#define SPI_TRANSFMT_MOSIBIDIR_MASK (0x10U)
#define SPI_TRANSFMT_MOSIBIDIR_SHIFT (4U)
#define SPI_TRANSFMT_MOSIBIDIR_SET(x) (((uint32_t)(x) << SPI_TRANSFMT_MOSIBIDIR_SHIFT) & SPI_TRANSFMT_MOSIBIDIR_MASK)
#define SPI_TRANSFMT_MOSIBIDIR_GET(x) (((uint32_t)(x) & SPI_TRANSFMT_MOSIBIDIR_MASK) >> SPI_TRANSFMT_MOSIBIDIR_SHIFT)

/*
 * LSB (RW)
 *
 * Transfer data with the least significant bit first 
 * 0x0: Most significant bit first 
 * 0x1: Least significant bit first 
 */
#define SPI_TRANSFMT_LSB_MASK (0x8U)
#define SPI_TRANSFMT_LSB_SHIFT (3U)
#define SPI_TRANSFMT_LSB_SET(x) (((uint32_t)(x) << SPI_TRANSFMT_LSB_SHIFT) & SPI_TRANSFMT_LSB_MASK)
#define SPI_TRANSFMT_LSB_GET(x) (((uint32_t)(x) & SPI_TRANSFMT_LSB_MASK) >> SPI_TRANSFMT_LSB_SHIFT)

/*
 * SLVMODE (RW)
 *
 * SPI Master/Slave mode selection 
 * 0x0: Master mode 
 * 0x1: Slave mode
 */
#define SPI_TRANSFMT_SLVMODE_MASK (0x4U)
#define SPI_TRANSFMT_SLVMODE_SHIFT (2U)
#define SPI_TRANSFMT_SLVMODE_SET(x) (((uint32_t)(x) << SPI_TRANSFMT_SLVMODE_SHIFT) & SPI_TRANSFMT_SLVMODE_MASK)
#define SPI_TRANSFMT_SLVMODE_GET(x) (((uint32_t)(x) & SPI_TRANSFMT_SLVMODE_MASK) >> SPI_TRANSFMT_SLVMODE_SHIFT)

/*
 * CPOL (RW)
 *
 *  SPI Clock Polarity 
 * 0x0: SCLK is LOW in the idle states 
 * 0x1: SCLK is HIGH in the idle states
 */
#define SPI_TRANSFMT_CPOL_MASK (0x2U)
#define SPI_TRANSFMT_CPOL_SHIFT (1U)
#define SPI_TRANSFMT_CPOL_SET(x) (((uint32_t)(x) << SPI_TRANSFMT_CPOL_SHIFT) & SPI_TRANSFMT_CPOL_MASK)
#define SPI_TRANSFMT_CPOL_GET(x) (((uint32_t)(x) & SPI_TRANSFMT_CPOL_MASK) >> SPI_TRANSFMT_CPOL_SHIFT)

/*
 * CPHA (RW)
 *
 * SPI Clock Phase 
 * 0x0: Sampling data at odd SCLK edges 
 * 0x1: Sampling data at even SCLK edges 
 */
#define SPI_TRANSFMT_CPHA_MASK (0x1U)
#define SPI_TRANSFMT_CPHA_SHIFT (0U)
#define SPI_TRANSFMT_CPHA_SET(x) (((uint32_t)(x) << SPI_TRANSFMT_CPHA_SHIFT) & SPI_TRANSFMT_CPHA_MASK)
#define SPI_TRANSFMT_CPHA_GET(x) (((uint32_t)(x) & SPI_TRANSFMT_CPHA_MASK) >> SPI_TRANSFMT_CPHA_SHIFT)

/* Bitfield definition for register: DIRECTIO */
/*
 * DIRECTIOEN (RW)
 *
 * Enable Direct IO 
 * 0x0: Disable 
 * 0x1: Enable
 */
#define SPI_DIRECTIO_DIRECTIOEN_MASK (0x1000000UL)
#define SPI_DIRECTIO_DIRECTIOEN_SHIFT (24U)
#define SPI_DIRECTIO_DIRECTIOEN_SET(x) (((uint32_t)(x) << SPI_DIRECTIO_DIRECTIOEN_SHIFT) & SPI_DIRECTIO_DIRECTIOEN_MASK)
#define SPI_DIRECTIO_DIRECTIOEN_GET(x) (((uint32_t)(x) & SPI_DIRECTIO_DIRECTIOEN_MASK) >> SPI_DIRECTIO_DIRECTIOEN_SHIFT)

