hpmicro/rtt-bsp-hpm6750evkmini/rtt_default_project_0/libraries/hpm-sdk/soc/ip/hpm_spi_regs.h
/*
 * RXTHRES (RW)
 *
 * Receive (RX) FIFO Threshold 
 * The RXFIFOInt interrupt or DMA request would be issued for consuming the RX FIFO when the RX data count is more than or equal to the RX FIFO threshold. 
 * 
 */
#define SPI_CTRL_RXTHRES_MASK (0xFF00U)
#define SPI_CTRL_RXTHRES_SHIFT (8U)
#define SPI_CTRL_RXTHRES_SET(x) (((uint32_t)(x) << SPI_CTRL_RXTHRES_SHIFT) & SPI_CTRL_RXTHRES_MASK)
#define SPI_CTRL_RXTHRES_GET(x) (((uint32_t)(x) & SPI_CTRL_RXTHRES_MASK) >> SPI_CTRL_RXTHRES_SHIFT)

/*
 * TXDMAEN (RW)
 *
 * TX DMA enable 
 * 
 */
#define SPI_CTRL_TXDMAEN_MASK (0x10U)
#define SPI_CTRL_TXDMAEN_SHIFT (4U)
#define SPI_CTRL_TXDMAEN_SET(x) (((uint32_t)(x) << SPI_CTRL_TXDMAEN_SHIFT) & SPI_CTRL_TXDMAEN_MASK)
#define SPI_CTRL_TXDMAEN_GET(x) (((uint32_t)(x) & SPI_CTRL_TXDMAEN_MASK) >> SPI_CTRL_TXDMAEN_SHIFT)

/*
 * RXDMAEN (RW)
 *
 * RX DMA enable 
 * 
 */
#define SPI_CTRL_RXDMAEN_MASK (0x8U)
#define SPI_CTRL_RXDMAEN_SHIFT (3U)
#define SPI_CTRL_RXDMAEN_SET(x) (((uint32_t)(x) << SPI_CTRL_RXDMAEN_SHIFT) & SPI_CTRL_RXDMAEN_MASK)
#define SPI_CTRL_RXDMAEN_GET(x) (((uint32_t)(x) & SPI_CTRL_RXDMAEN_MASK) >> SPI_CTRL_RXDMAEN_SHIFT)

/*
 * TXFIFORST (RW)
 *
 * Transmit FIFO reset 
 * Write 1 to reset. It is automatically cleared to 0 after the reset operation completes. 
 * 
 */
#define SPI_CTRL_TXFIFORST_MASK (0x4U)
#define SPI_CTRL_TXFIFORST_SHIFT (2U)
#define SPI_CTRL_TXFIFORST_SET(x) (((uint32_t)(x) << SPI_CTRL_TXFIFORST_SHIFT) & SPI_CTRL_TXFIFORST_MASK)
#define SPI_CTRL_TXFIFORST_GET(x) (((uint32_t)(x) & SPI_CTRL_TXFIFORST_MASK) >> SPI_CTRL_TXFIFORST_SHIFT)

/*
 * RXFIFORST (RW)
 *
 * Receive FIFO reset 
 * Write 1 to reset. It is automatically cleared to 0 after the reset operation completes. 
 * 
 */
#define SPI_CTRL_RXFIFORST_MASK (0x2U)
#define SPI_CTRL_RXFIFORST_SHIFT (1U)
#define SPI_CTRL_RXFIFORST_SET(x) (((uint32_t)(x) << SPI_CTRL_RXFIFORST_SHIFT) & SPI_CTRL_RXFIFORST_MASK)
#define SPI_CTRL_RXFIFORST_GET(x) (((uint32_t)(x) & SPI_CTRL_RXFIFORST_MASK) >> SPI_CTRL_RXFIFORST_SHIFT)

/*
 * SPIRST (RW)
 *
 * SPI reset 
 * Write 1 to reset. It is automatically cleared to 0 after the reset operation completes. 
 * 
 */
#define SPI_CTRL_SPIRST_MASK (0x1U)
#define SPI_CTRL_SPIRST_SHIFT (0U)
#define SPI_CTRL_SPIRST_SET(x) (((uint32_t)(x) << SPI_CTRL_SPIRST_SHIFT) & SPI_CTRL_SPIRST_MASK)
#define SPI_CTRL_SPIRST_GET(x) (((uint32_t)(x) & SPI_CTRL_SPIRST_MASK) >> SPI_CTRL_SPIRST_SHIFT)

/* Bitfield definition for register: STATUS */
/*
 * TXNUM_7_6 (RO)
 *
 * Number of valid entries in the Transmit FIFO 
 * 
 */
#define SPI_STATUS_TXNUM_7_6_MASK (0x30000000UL)
#define SPI_STATUS_TXNUM_7_6_SHIFT (28U)
#define SPI_STATUS_TXNUM_7_6_GET(x) (((uint32_t)(x) & SPI_STATUS_TXNUM_7_6_MASK) >> SPI_STATUS_TXNUM_7_6_SHIFT)

/*
 * RXNUM_7_6 (RO)
 *
 * Number of valid entries in the Receive FIFO 
 * 
 */
#define SPI_STATUS_RXNUM_7_6_MASK (0x3000000UL)
#define SPI_STATUS_RXNUM_7_6_SHIFT (24U)
#define SPI_STATUS_RXNUM_7_6_GET(x) (((uint32_t)(x) & SPI_STATUS_RXNUM_7_6_MASK) >> SPI_STATUS_RXNUM_7_6_SHIFT)

/*
 * TXFULL (RO)
 *
 * Transmit FIFO Full flag 
 * 
 */
#define SPI_STATUS_TXFULL_MASK (0x800000UL)
#define SPI_STATUS_TXFULL_SHIFT (23U)
#define SPI_STATUS_TXFULL_GET(x) (((uint32_t)(x) & SPI_STATUS_TXFULL_MASK) >> SPI_STATUS_TXFULL_SHIFT)

/*
 * TXEMPTY (RO)
 *
 * Transmit FIFO Empty flag
 */
#define SPI_STATUS_TXEMPTY_MASK (0x400000UL)
#define SPI_STATUS_TXEMPTY_SHIFT (22U)
#define SPI_STATUS_TXEMPTY_GET(x) (((uint32_t)(x) & SPI_STATUS_TXEMPTY_MASK) >> SPI_STATUS_TXEMPTY_SHIFT)

/*
 * TXNUM_5_0 (RO)
 *
 * Number of valid entries in the Transmit FIFO
 */
#define SPI_STATUS_TXNUM_5_0_MASK (0x3F0000UL)
#define SPI_STATUS_TXNUM_5_0_SHIFT (16U)
#define SPI_STATUS_TXNUM_5_0_GET(x) (((uint32_t)(x) & SPI_STATUS_TXNUM_5_0_MASK) >> SPI_STATUS_TXNUM_5_0_SHIFT)

/*
 * RXFULL (RO)
 *
 * Receive FIFO Full flag
 */
#define SPI_STATUS_RXFULL_MASK (0x8000U)
#define SPI_STATUS_RXFULL_SHIFT (15U)
#define SPI_STATUS_RXFULL_GET(x) (((uint32_t)(x) & SPI_STATUS_RXFULL_MASK) >> SPI_STATUS_RXFULL_SHIFT)

/*
 * RXEMPTY (RO)
 *
 * Receive FIFO Empty flag
 */
#define SPI_STATUS_RXEMPTY_MASK (0x4000U)
#define SPI_STATUS_RXEMPTY_SHIFT (14U)
#define SPI_STATUS_RXEMPTY_GET(x) (((uint32_t)(x) & SPI_STATUS_RXEMPTY_MASK) >> SPI_STATUS_RXEMPTY_SHIFT)

/*
 * RXNUM_5_0 (RO)
 *
 * Number of valid entries in the Receive FIFO
 */
#define SPI_STATUS_RXNUM_5_0_MASK (0x3F00U)
#define SPI_STATUS_RXNUM_5_0_SHIFT (8U)
#define SPI_STATUS_RXNUM_5_0_GET(x) (((uint32_t)(x) & SPI_STATUS_RXNUM_5_0_MASK) >> SPI_STATUS_RXNUM_5_0_SHIFT)

/*
 * SPIACTIVE (RO)
 *
 * SPI register programming is in progress. 
 * In master mode, SPIActive becomes 1 after the SPI command register is written and becomes 0 after the transfer is finished. 
 * In slave mode, SPIActive becomes 1 after the SPI CS signal is asserted and becomes 0 after the SPI CS signal is deasserted. 
 * Note that due to clock synchronization, it may take at most two spi_clock cycles for SPIActive to change when the corresponding condition happens. 
 * Note this bit stays 0 when Direct IO Control or the memory-mapped interface is used. 
 * 
 */
#define SPI_STATUS_SPIACTIVE_MASK (0x1U)
#define SPI_STATUS_SPIACTIVE_SHIFT (0U)
#define SPI_STATUS_SPIACTIVE_GET(x) (((uint32_t)(x) & SPI_STATUS_SPIACTIVE_MASK) >> SPI_STATUS_SPIACTIVE_SHIFT)

/* Bitfield definition for register: INTREN */
/*
 * SLVCMDEN (RW)
 *
 * Enable the Slave Command Interrupt. 
 * Control whether interrupts are triggered whenever slave commands are received. 
 * (Slave mode only) 
 * 
 */
#define SPI_INTREN_SLVCMDEN_MASK (0x20U)
#define SPI_INTREN_SLVCMDEN_SHIFT (5U)
#define SPI_INTREN_SLVCMDEN_SET(x) (((uint32_t)(x) << SPI_INTREN_SLVCMDEN_SHIFT) & SPI_INTREN_SLVCMDEN_MASK)
#define SPI_INTREN_SLVCMDEN_GET(x) (((uint32_t)(x) & SPI_INTREN_SLVCMDEN_MASK) >> SPI_INTREN_SLVCMDEN_SHIFT)

/*
 * ENDINTEN (RW)
 *
 * Enable the End of SPI Transfer interrupt. 
 * Control whether interrupts are triggered when SPI transfers end. 
 * (In slave mode, end of read status transaction doesn’t trigger this interrupt.) 
 * 
 */
#define SPI_INTREN_ENDINTEN_MASK (0x10U)
#define SPI_INTREN_ENDINTEN_SHIFT (4U)
#define SPI_INTREN_ENDINTEN_SET(x) (((uint32_t)(x) << SPI_INTREN_ENDINTEN_SHIFT) & SPI_INTREN_ENDINTEN_MASK)
#define SPI_INTREN_ENDINTEN_GET(x) (((uint32_t)(x) & SPI_INTREN_ENDINTEN_MASK) >> SPI_INTREN_ENDINTEN_SHIFT)

